---
kind: property
id: P:Autodesk.Revit.DB.Element.Category
zh: 构件、图元、元素
source: html/8990bd36-af08-fc99-496b-f94fcb056b21.htm
---
# Autodesk.Revit.DB.Element.Category Property

**中文**: 构件、图元、元素

Retrieves a Category object that represents the category or sub category in which the
element resides.

## Syntax (C#)
```csharp
public Category Category { get; }
```

## Remarks
All category objects can be retrieved from the application by using the Categories property
of the Application.Settings object.